{
  "backend/main.mo": "Main Motoko actor for the Aparna Millets backend, defining content data types (sections, contact info, users) and initializing authorization and blob storage mixins with default section content.",
  "feature_evidence.json": "Feature evidence report confirming that the Hero section descriptive paragraph in Hero.tsx uses the `text-gray-600` Tailwind class for a softer dark gray color.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Aparna Natural Millets website, mounting the React app at `#root` and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app component configuring TanStack Router with `/` (HomePage) and `/admin` (AdminDashboard) routes, wrapped in QueryClientProvider and ThemeProvider with navigation logging.",
  "frontend/src/components/AboutCompany.tsx": "About Company section component that fetches content via `useGetAllContent` and renders the company description with a fallback about the farmer cooperative in Rayagada, Odisha.",
  "frontend/src/components/admin/AdminHeader.tsx": "Sticky admin header showing the app title, logged-in user's name, and a logout button that clears identity and query cache before redirecting to the home page.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin layout component that composes the header, sidebar, and a dynamic editor panel, routing to the appropriate section editor based on the current URL parameter.",
  "frontend/src/components/admin/AdminSidebar.tsx": "Fixed left sidebar for the admin panel with categorized navigation links to all content section editors, highlighting the currently active section.",
  "frontend/src/components/admin/editors/AboutCompanyEditor.tsx": "Admin editor form for updating the 'About Company' section's title and content, loading existing data from the backend and saving changes via `useUpdateSection`.",
  "frontend/src/components/admin/editors/ContactEditor.tsx": "Admin editor form for updating contact information (representative, email, phone, address), serializing the data as JSON and saving it to the 'contact' section.",
  "frontend/src/components/admin/editors/FinancialOverviewEditor.tsx": "Admin editor form for updating the 'Financial Overview' section's title and content, pre-populated from existing backend data and saved via `useUpdateSection`.",
  "frontend/src/components/admin/editors/HeroEditor.tsx": "Admin editor form for updating the homepage hero section's title and description, loading current values from the backend and persisting changes via `useUpdateSection`.",
  "frontend/src/components/admin/editors/MarketStrategyEditor.tsx": "Admin editor form for updating the 'Market Strategy' section's title and strategy details, pre-populated from existing content and saved via `useUpdateSection`.",
  "frontend/src/components/admin/editors/NextStepsEditor.tsx": "Admin editor component for the 'Conclusion & Next Steps' section, allowing editing of the section title and implementation timeline content with save functionality via React Query mutation.",
  "frontend/src/components/admin/editors/ProjectVisionEditor.tsx": "Admin editor component for the 'Project Vision' section, providing form fields to update the section title and vision statement/objectives content.",
  "frontend/src/components/admin/editors/SocialImpactEditor.tsx": "Admin editor component for the 'Social & Economic Impact' section, enabling updates to the section title and impact details content.",
  "frontend/src/components/admin/editors/SupportRequestedEditor.tsx": "Admin editor component for the 'Support Requested' section, allowing edits to the section title and support details content describing assistance needs.",
  "frontend/src/components/admin/editors/TechnicalSpecsEditor.tsx": "Admin editor component for the 'Technical Specifications' section, providing form fields to update the section title and technical details content.",
  "frontend/src/components/admin/editors/ValueChainEditor.tsx": "Admin editor component for the 'Value Chain' section, enabling updates to the section title and value chain workflow/KPI details content.",
  "frontend/src/components/admin/editors/WhyRayagadaEditor.tsx": "Admin editor component for the 'Why Rayagada' section that fetches existing content, allows editing the section title and body text via a form, and saves updates to the backend.",
  "frontend/src/components/admin/LoginScreen.tsx": "Renders a login screen card that triggers Internet Identity authentication, showing a spinner while the login is in progress.",
  "frontend/src/components/admin/ProfileSetup.tsx": "Displays a profile setup form that collects the user's name and saves it via the `useSaveCallerUserProfile` mutation before proceeding to the dashboard.",
  "frontend/src/components/ConnectionStatus.tsx": "UI component displaying backend connection status as a success or error alert, with optional retry button and retry count display.",
  "frontend/src/components/ContactForm.tsx": "Contact section component rendering contact info (Bibhuti Bhusana Mishra) and a validated contact form with toast notifications for submission success or failure.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class component that catches runtime errors in its child tree and displays a styled error UI with error details, component stack trace, and options to reload or retry.",
  "frontend/src/components/FinancialOverview.tsx": "Displays a financial overview section with funding sources and year-1 projections, pulling content from a backend API via useGetAllContent and falling back to hardcoded defaults.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company description, quick-link scroll buttons, contact info, and a copyright line including the current year.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, tagline, title, and description fetched from the backend (with hardcoded fallbacks), plus a smooth-scroll CTA button to the contact section.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple full-screen loading indicator that displays a spinning Loader2 icon and a 'Loading...' message.",
  "frontend/src/components/MarketStrategy.tsx": "Renders the market strategy section with B2G/B2B/B2C channel details fetched from the backend (with defaults), alongside a product showcase image.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with smooth-scroll links to all page sections, a scroll-aware background blur effect, and a collapsible mobile menu.",
  "frontend/src/components/NextSteps.tsx": "Displays a three-phase implementation timeline with icon cards and a detailed content block, using backend data from useGetAllContent with hardcoded fallbacks.",
  "frontend/src/components/ProjectVision.tsx": "Displays the Project Vision section with a title, vision statement, and three objective cards (Assured Procurement, Post-harvest Loss Reduction, Nutrition & Supply), pulling content from a CMS query with fallback defaults.",
  "frontend/src/components/SocialImpact.tsx": "Renders the Social & Economic Impact section with three stat cards (Employment, Farmer Livelihoods, Nutrition) and a detailed text block, using CMS content with fallback defaults.",
  "frontend/src/components/SupportRequested.tsx": "Shows the Support Requested section with four icon cards (Administrative, Infrastructure, Market, Financial) and a detailed text block describing government support needs, with CMS-driven content and fallbacks.",
  "frontend/src/components/TechnicalSpecs.tsx": "Displays technical specifications for the millet processing unit in a two-column layout with descriptive text and an equipment image, using CMS content with fallback defaults.",
  "frontend/src/components/ValueChain.tsx": "Renders the Value Chain Process section with a diagram image and a detailed text block covering procurement, processing, value addition, and distribution stages, using CMS content with fallbacks.",
  "frontend/src/components/WhyRayagada.tsx": "Displays the 'Why Rayagada?' section as a text-only block explaining the regional context and project rationale, with CMS-driven content and fallback defaults.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data, including content sections, contact info, and user profiles, all using the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind and defines a warm earthy CSS custom property color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that handles authentication state transitions, showing a login screen, loading spinner, profile setup, or the main admin layout depending on the user's auth and profile status.",
  "frontend/src/pages/HomePage.tsx": "Main public-facing homepage that composes all section components (Hero, About, Vision, etc.) within a Suspense boundary and shared Navigation/Footer layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and browser history.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, border radii, font families, accordion keyframe animations, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 15) describing the Aparna Natural Millets Producer Co. Ltd. website, including its architectural notes, existing features, known issues, and multi-audience design goals for government officials, investors, and customers."
}