{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting 13 implemented features for the Aparna Natural Millets website, mapping each to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the purpose and content of each component, style, and configuration file in the project.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm earthy tones (golden amber, terracotta, browns) for light and dark modes, avoiding blue/purple.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component orchestrating all sections (Navigation, Hero, AboutCompany, ProjectVision, etc.) and Footer in a single-page layout.",
  "frontend/src/components/AboutCompany.tsx": "About section component explaining the farmer-owned cooperative model, alignment with OMM/PMFME schemes, and mission to empower tribal farmers with icons and cards.",
  "frontend/src/components/ContactForm.tsx": "Contact section with company contact information and interactive inquiry form featuring validation, toast notifications, and form state management.",
  "frontend/src/components/FinancialOverview.tsx": "Financial overview section displaying total project cost (₹1.15 Crore), funding sources breakdown, and Year 1 revenue/profit projections in card layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick navigation links with smooth scrolling, contact details, and a copyright notice with a Lovable.dev attribution link.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring a background image with overlay, main heading about the millet processing unit, tagline, and call-to-action buttons for contact and learning more.",
  "frontend/src/components/MarketStrategy.tsx": "Market strategy section displaying three sales channels (B2G institutional, B2B retail, B2C consumer brand) with icons, descriptions, and a product showcase image.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with smooth scrolling to page sections, sticky header with scroll-based styling, and a mobile hamburger menu for smaller screens.",
  "frontend/src/components/NextSteps.tsx": "Next steps section outlining a three-phase implementation roadmap (commissioning, operationalization, scale) with timeframes, activities, and a closing commitment statement.",
  "frontend/src/components/ProjectVision.tsx": "Project vision section presenting the core mission statement and three main objectives (assured procurement, loss reduction, nutrition supply) in a card-based layout with icons.",
  "frontend/src/components/SocialImpact.tsx": "React component displaying three cards highlighting the social and economic impact of the millet processing project: 15 direct jobs for tribal youth/women, support for 500+ farmers with improved incomes, and nutrition/food security benefits through ICDS/MDM supply.",
  "frontend/src/components/SupportRequested.tsx": "React component outlining four types of support requested from district administration (administrative guidance, procurement convergence, land/infrastructure assistance, and linkages/capacity building) with a call-to-action for a district-level meeting within 60-90 days.",
  "frontend/src/components/TechnicalSpecs.tsx": "React component detailing the technical specifications of a 1 TPD millet processing unit, including pre-cleaning, de-hulling, pulverizing, roasting, and packaging equipment, with information on ancillary systems and modular expansion capability to 2-3 TPD.",
  "frontend/src/components/ValueChain.tsx": "React component visualizing the four-stage value chain process (aggregation, cleaning, processing, dispatch) with operational KPI targets for Year 1, including procurement coverage, post-harvest loss limits, moisture content, and delivery timelines.",
  "frontend/src/components/WhyRayagada.tsx": "React component explaining the rationale for establishing a millet processing unit in Rayagada district, emphasizing local production context, current market challenges, benefits of local value addition, and projected social impact for tribal farming communities.",
  "frontend/src/hooks/useActor.ts": "Custom React hook managing Internet Computer actor creation with authentication support, using React Query to cache actors based on identity and automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm earthy color palette (golden amber, wheat, terracotta) for light and dark modes, using OKLCH color space and CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom color system using OKLCH, typography plugin, container queries, animations, and custom font families.",
  "project_state.json": "Project metadata for Aparna Natural Millets Producer Co. Ltd. website, documenting multi-audience architecture, required imagery, and implemented features for the 1 TPD millet processing cooperative showcase site."
}