{
  "backend/main.mo": "Main Motoko actor defining data types (CommonSection, ContentData, ContactInfo, User, etc.) and state management for a biogas/millet project website with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including error boundaries, loading states, fallback content, router fixes, and connection handling with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, fallback content strategies, error handling, and styling approach with warm earthy color themes.",
  "frontend/index.css": "Global Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using warm, earthy tones (no blues/purples) for agricultural branding.",
  "frontend/index.html": "HTML entry point for the Aparna Natural Millets Producer Co. Ltd. website with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with HomePage and AdminDashboard routes, QueryClient, ThemeProvider, and Suspense boundaries with navigation logging.",
  "frontend/src/components/AboutCompany.tsx": "About section component displaying company information with comprehensive fallback content about the farmer cooperative, fetching data from backend with graceful error handling.",
  "frontend/src/components/admin/AdminHeader.tsx": "Admin header component displaying the application title, logged-in user profile information, and a logout button that clears authentication and redirects to home.",
  "frontend/src/components/admin/AdminLayout.tsx": "Main admin layout component that renders the header, sidebar, and dynamically switches between different section editors based on the current route parameter.",
  "frontend/src/components/admin/AdminSidebar.tsx": "Navigation sidebar component for admin dashboard with categorized links to different content sections (hero, about, vision, technical specs, etc.) using icons and active state highlighting.",
  "frontend/src/components/admin/editors/AboutCompanyEditor.tsx": "Editor component for managing the About Company section content with fields for section title and main content text, using form state and mutation hooks.",
  "frontend/src/components/admin/editors/ContactEditor.tsx": "Contact information editor with form fields for representative name, email, phone, and address, including email validation and storing data as JSON in the contact section.",
  "frontend/src/components/admin/editors/FinancialOverviewEditor.tsx": "Editor component for the Financial Overview section allowing updates to section title and detailed financial content including costs, funding, and projections.",
  "frontend/src/components/admin/editors/HeroEditor.tsx": "Hero section editor component with fields for company name/title and tagline/description that appear at the top of the homepage.",
  "frontend/src/components/admin/editors/MarketStrategyEditor.tsx": "Admin editor component for managing the Market Strategy section with form fields for section title and strategy details (B2G, B2B, B2C channels, SKUs, target audience).",
  "frontend/src/components/admin/editors/NextStepsEditor.tsx": "Admin editor component for managing the Next Steps section with form fields for section title and implementation timeline details.",
  "frontend/src/components/admin/editors/ProjectVisionEditor.tsx": "Admin editor component for managing the Project Vision section with form fields for section title and vision statement/objectives content.",
  "frontend/src/components/admin/editors/SocialImpactEditor.tsx": "Admin editor component for managing the Social & Economic Impact section with form fields for section title and impact details (employment, farmer livelihoods, nutrition programs).",
  "frontend/src/components/admin/editors/SupportRequestedEditor.tsx": "Admin editor component for managing the Support Requested section with form fields for section title and support details (administrative guidance, procurement, infrastructure, capacity building).",
  "frontend/src/components/admin/editors/TechnicalSpecsEditor.tsx": "Admin editor component for managing the Technical Specifications section with form fields for section title and technical details (processing components, ancillary systems, expansion plans).",
  "frontend/src/components/admin/editors/ValueChainEditor.tsx": "React component for editing the Value Chain section with form fields for section title and content, using React Query hooks for fetching and updating data with toast notifications.",
  "frontend/src/components/admin/editors/WhyRayagadaEditor.tsx": "React component for editing the Why Rayagada section with form fields for section title and content, using React Query hooks for fetching and updating data with toast notifications.",
  "frontend/src/components/admin/LoginScreen.tsx": "Admin login screen component that uses Internet Identity authentication with a card-based UI showing login button and loading states.",
  "frontend/src/components/admin/ProfileSetup.tsx": "Profile setup form component that prompts authenticated users to enter their name before accessing the admin dashboard, with validation and toast notifications.",
  "frontend/src/components/ConnectionStatus.tsx": "Reusable connection status alert component showing connected/disconnected state with retry button, error messages, and retry count display for backend connectivity monitoring.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with fields for name, email, phone, and message; displays contact information (representative, email, phone, address) fetched from API or fallback defaults, and simulates form submission with toast notifications.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches and displays errors with detailed stack traces, providing reload and retry options for graceful error handling.",
  "frontend/src/components/FinancialOverview.tsx": "Displays financial overview section with project cost breakdown, funding sources, year 1 projections, and key assumptions; content fetched from API with fallback defaults.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns (company info, quick links with smooth scroll, contact details), separator, and copyright notice including app identifier.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, title, tagline, and description; fetches content from API with loading skeleton and fallback defaults, includes CTA buttons for contact and scrolling.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple full-screen loading spinner component using Lucide's Loader2 icon with centered layout and loading text.",
  "frontend/src/components/MarketStrategy.tsx": "Market strategy section displaying multi-channel distribution approach (B2G, B2B, B2C) and sustainability levers in a two-column layout with text and product showcase image; content from API or defaults.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with smooth scrolling to sections, sticky header with scroll-based styling, mobile hamburger menu, and 11 navigation items covering all major sections.",
  "frontend/src/components/NextSteps.tsx": "Displays a three-phase implementation timeline (Commissioning, Operationalization, Scale & Consolidate) with icons and detailed content fetched from the backend or using default fallback text.",
  "frontend/src/components/ProjectVision.tsx": "Renders the project vision section with three objective cards (Assured Procurement, Post-harvest Loss Reduction, Nutrition & Supply) using icons and descriptions, with content fetched from backend or defaults.",
  "frontend/src/components/SocialImpact.tsx": "Shows social and economic impact metrics in three cards (Employment, Farmer Livelihoods, Nutrition) with icons and detailed content about employment generation, farmer benefits, and food security.",
  "frontend/src/components/SupportRequested.tsx": "Displays four support areas requested from government (Administrative Guidance, Infrastructure Support, Market Linkages, Financial Facilitation) with icons and detailed requirements.",
  "frontend/src/components/TechnicalSpecs.tsx": "Presents technical specifications of the 1 TPD millet processing unit with key components, ancillary systems, and an equipment image in a two-column layout.",
  "frontend/src/components/ValueChain.tsx": "Illustrates the end-to-end value chain process from procurement to distribution with a diagram image and detailed workflow steps including Year 1 operational KPIs.",
  "frontend/src/components/WhyRayagada.tsx": "Explains the rationale for establishing the processing unit in Rayagada district, highlighting local challenges and benefits of the project location.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating content sections, contact info, and user profiles through the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earthy color palette (golden, amber, terracotta tones) for both light and dark modes, inspired by millets and grain.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page component that handles authentication flow, showing login screen for unauthenticated users, profile setup for new users, or the admin layout for authenticated users with profiles.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that renders the full website layout with Navigation, Hero, and 11 content sections (AboutCompany, ProjectVision, WhyRayagada, TechnicalSpecs, FinancialOverview, SocialImpact, MarketStrategy, ValueChain, SupportRequested, NextSteps, ContactForm) wrapped in Suspense with a LoadingSpinner fallback, plus Footer.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with functions for persisting parameters in sessionStorage and clearing sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens using OKLCH color space for theme colors (primary, secondary, destructive, muted, accent, card, sidebar, chart), custom border radius variables, Inter font family, and accordion animation keyframes.",
  "project_state.json": "Project metadata describing a multi-audience millet processing cooperative website with admin dashboard, Internet Identity authentication, and Motoko backend storage; currently has a critical deployment issue causing blank page on load."
}